<template>
  <ThemeProvider :name="currTheme">
    <Loading v-if="!isInit" />
    <section v-else class="container">
      <SectionName
        title="Terms and Conditions"
        subTitle="ข้อกำหนดและเงื่อนไขการเข้าร่วมกิจกรรม"
      />
      <InfoContainer class="policy-info">
        <h2>นิยามศัพท์</h2>
        <ul>
          <li>KEYWORD 1</li>
          <li>KEYWORD 2</li>
        </ul>

        <h2>คุณสมบัติของผู้เข้าร่วม</h2>
        <ol>
          <li>
            ผู้เข้าร่วมจะต้องมีคุณสมบัติ ดังนี้
            <ul>
              <li>
                มีอายุระหว่าง 18 - 23 ปี โดยเกิดระหว่างวันที่ 1 มกราคม พ.ศ. 2540
                - 1 มกราคม พ.ศ. 2546
              </li>
              <li>
                ไม่จำกัดวุฒิการศึกษา สาขา/คณะที่เรียน ชั้นปี หรือตำแหน่งงาน
              </li>
              <li>ไม่มีโรคติดต่อร้ายแรง</li>
              <li>ไม่อยู่ในกลุ่มเสี่ยงติดเชื้อ COVID-19 ตามเงื่อนไขดังนี้</li>
              <ul>
                <li>
                  ไม่มีอาการระบบทางเดินหายใจผิดปกติ อย่างใดอย่างหนึ่งดังต่อไปนี้
                  เช่น ไอ น้ำมูก เจ็บคอ หายใจเหนื่อย หรือหายใจลำบาก
                </li>
                <li>
                  ไม่ได้เดินทางมาจากหรืออาศัยอยู่ในพื้นที่ที่มีรายงานการติดเชื้อของโรค
                  COVID-19 ใน 14 วันที่ผ่านมา
                </li>
                <li>
                  ไม่มีประวัติสัมผัสกับผู้ป่วยที่ยืนยันถึงการเป็นโรคติดเชื้อไวรัส
                  COVID-19 เป็นเวลาอย่างน้อย ___
                  วันก่อนวันสัมภาษณ์และวันจัดกิจกรรม
                </li>
                <li>
                  ในสถานที่ที่ไปเป็นประจำ
                  ไม่มีการสัมผัสหรือมีปฏิสัมพันธ์กับคนที่มีอาการไข้ ไอ น้ำมูก
                  เสมหะ ในช่วงเวลาภายใน ___
                </li>
              </ul>
              <li>ไม่มีประวัติการกระทำผิดกฎหมายอาญาร้ายแรง</li>
              <li>สามารถมาเข้าร่วมค่ายได้ตลอดระยะเวลา 4 วัน</li>
            </ul>
          </li>
          <li>
            หากมีการตรวจพบในภายหลังว่าคุณสมบัติของผู้สมัครไม่เป็นไปตามที่กล่าวข้างต้น
            ขอสงวนสิทธิ์ในการเพิกถอนสิทธิ์การเข้าร่วมค่ายทันที
          </li>
        </ol>

        <h2>รายละเอียดการสมัคร</h2>
        <ol>
          <li>
            ระบบรับสมัครจะเปิดตั้งแต่วันที่ 14 กันยายน พ.ศ. 2563 จนถึงวันที่ 7
            พฤศจิกายน พ.ศ. 2563 เวลา 23.59 น.
          </li>
          <li>
            ผู้สมัครสามารถสมัครได้เพียง 1 สาขาเท่านั้น
            โดยการเลือกสาขาจะอยู่ในขั้นตอนที่ 2 ของระบบรับสมัคร
          </li>
          <li>
            หากมีการยืนยันการเลือกสาขาและผ่านขั้นตอนที่ 2 แล้ว
            ผู้สมัครจะไม่สามารถเปลี่ยนสาขาได้อีก
          </li>
          <li>
            การสมัครจะเสร็จสิ้นก็ต่อเมื่อผู้สมัครกดปุ่ม ส่งใบสมัคร
            ในขั้นตอนสุดท้ายแล้วเท่านั้น
            และเมื่อกดปุ่มแล้วจะไม่สามารถแก้ไขข้อมูลได้อีก
          </li>
          <li>การตัดสินของคณะกรรมการถือเป็นที่สิ้นสุด</li>
        </ol>

        <h2>การตัดสินของคณะกรรมการถือเป็นที่สิ้นสุด</h2>
        <ul>
          <li>
            หลังจากประกาศผลตัวจริง ผู้เข้าร่วมจะต้องโอนเงินค่ามัดจำเป็นจำนวน 500
            บาทเพื่อเป็นการยืนยันสิทธิ์ในการเข้าค่าย
            และจะได้รับเงินคืนในวันสุดท้ายของค่ายหากเข้าร่วมครบทุกกิจกรรมตลอดช่วงระยะเวลาค่าย
          </li>
          <li>
            ทางค่ายจะรับผิดชอบค่าใช้จ่ายดังต่อไปนี้ให้กับผู้เข้าร่วม
            <ul>
              <li>สถานที่ภายในค่าย</li>
              <li>อาหารและของว่างภายในค่าย</li>
              <li>การเดินทางในช่วงระยะเวลากิจกรรม</li>
              <li>ประกันการเดินทาง</li>
              <li>ของที่ระลึกจากค่าย</li>
            </ul>
          </li>
        </ul>

        <h2>Candidates (and also campers) conditions</h2>
        <ul>
          <li>ข้อมูลที่ผู้สมัครได้กรอกทั้งหมดนี้ จะเป็นไปตาม PDPA</li>
          <li>
            อนุญาตให้คณะกรรมการจัดงานติดต่อไปยังผู้สมัครผ่านข้อมูลการติดต่อที่ผู้สมัครได้กรอกไว้
          </li>
          <li>อายุ 18 - 23 ปี (1 มกรา 1997 - 1 มกรา 2003)</li>
          <li>ต้องมาเข้าค่ายได้ตลอด 4 วัน</li>
          <li>
            ต้องไม่อยู่ในกลุ่มเสี่ยงติดเชื้อ COVID-19 และโรคติดต่อร้ายแรง
            จนถึงช่วงสัมภาษณ์และเวลาค่าย (ลองไปดู คำถามในพวกสายการบิน / รพ.)
          </li>
          <li>เงินมัดจำ (แจ้งก่อนว่าต้องจ่าย 500)</li>
          <li>
            หากพบภายหลังว่าขาดคุณสมบัติข้อใดข้อหนึ่งข้างต้น
            ขอสงวนสิทธิ์ในการเพิกถอนสิทธิ์การเข้าร่วมค่ายทันที
          </li>
          <li>
            ทางค่ายจะรับผิดชอบค่าใช้จ่ายดังต่อไปนี้
            <ul>
              ค่า....
            </ul>
          </li>
          <li>สื่อสารภาษาไทยได้อย่างคล่องแคล่ว ชำนาญ ฉะฉาน ว่องไว</li>
          <li>ไม่มีประวัติกระทำผิดกฎหมายอาญาร้ายแรง</li>
          <li>การยืนยันสาขาและการส่งใบสมัคร จะไม่สามารถกลับมาแก้ไขได้อีก</li>
          <li>
            ข้าพเจ้าขอรับรองว่าข้อมูลที่ได้กรอกในแบบฟอร์มทั้งหมดนั้งเปงความจริง
          </li>
          <li>การตัดสินของคณะกรรมการจัดค่ายถือเป็นที่สิ้นสุด</li>
          <li>อีเมลที่จะเอาไปใช้ต่อกับ สปอน และ มาร์เกตติ้งค่ายปีถัดไป</li>
          <li>รูปที่จะใช้ประชาสัมพันธ์ค่าย</li>
        </ul>

        <h2>Campers conditions</h2>
        <li>
          ห้ามกระทำการอันส่งผลให้บังเกิดภาพลักษณ์เสื่อมเสียต่อค่ายหรือหน่วยงานที่มีความเกี่ยวข้องกับ
        </li>
        <li>
          ผู้เข้าร่วมจะต้องเตรียมเครื่องใช้ส่วนตัว
          อุปกรณ์ป้องกันตนเองและผู้อื่นจากเชื้อโรคระบาดเนื่องในสถานการณ์ปัจจุบัน
          และปฏิบัติตามหลักสุขอนามัยเพื่อป้องกันการติดเชื้อ
        </li>
        <li>
          ทางค่ายไม่แนะนำให้นำทรัพย์สินมีค่าที่ไม่เกี่ยวข้องกับการเข้าร่วมค่าย
          และจะไม่รับผิดชอบต่อการสูญเสีย สูญหาย
          เสื่อมสภาพของทรัพย์สินส่วนตัวของผู้เข้าร่วมค่ายไม่ว่าในกรณีใด ๆ
          ทั้งสิ้น
        </li>
        <li>
          รับผิดชอบต่อทรัพย์สินส่วนรวม
          หากเกิดการเสียหายผู้เข้าร่วมต้องรับผิดชอบด้วยตนเอง
        </li>
        <li>
          ต้องไม่อยู่ในกลุ่มเสี่ยงหรือมีข้อบ่งชี้ติดเชื้อ COVID-19
          และโรคติดต่อร้ายแรง ตลอดช่วงระยะเวลาค่าย
          และต้องให้ความร่วมมือกับมาตรการการป้องกันและคัดกรองของค่ายตลอดช่วงระยะเวลาค่าย
        </li>
        <li>พิจารณาให้เซ็นรับรองเพิ่มเติมหลังจากติดค่ายอีกที (Trusted app)</li>
      </InfoContainer>
      <Footer />
    </section>
  </ThemeProvider>
</template>
<script>
import ThemeProvider from '~/components/ThemeProvider.vue'
import Loading from '~/components/result/Loading.vue'
import { selectText } from '~/utils/dom'

export default {
  layout: 'secondary',
  head() {
    return {
      title: `ข้อกำหนดและเงื่อนไขการเข้าร่วมกิจกรรม - 18th Young Webmaster Camp`,
      meta: [
        {
          hid: 'og:title',
          property: 'og:title',
          content: `ข้อกำหนดและเงื่อนไขการเข้าร่วมกิจกรรม - 18th Young Webmaster Camp`,
        },
        {
          hid: 'og:description',
          property: 'og:description',
          content: 'ข้อกำหนดและเงื่อนไขการเข้าร่วมกิจกรรม',
        },
        {
          hid: 'description',
          name: 'description',
          content: 'ข้อกำหนดและเงื่อนไขการเข้าร่วมกิจกรรม',
        },
      ],
    }
  },
  components: {
    ThemeProvider,
    Loading,
    SectionName: () => import('~/components/ywc18/SectionName.vue'),
    InfoContainer: () => import('~/components/InfoContainer.vue'),
    Footer: () => import('~/components/sections/ywc18/Footer.vue'),
  },
  data() {
    return {
      currTheme: '',
      isInit: false,
    }
  },
  mounted() {
    this.isInit = true
  },
  methods: {
    selectText,
  },
}
</script>
<style lang="scss">
@import '../assets/css/global';
.packages-sponsor,
.policy-info {
  background: #fbfbfb;
  box-shadow: 0px 15px 35px rgba(0, 0, 0, 0.2);
}
.policy-info {
  p,
  li,
  ul,
  span {
    font-family: CmPrasanmit, system-ui, -apple-system, sans-sreif;
    font-size: 24px;
    font-weight: 700;
    text-indent: 42px;
    @media screen and (max-width: 576px) {
      text-indent: 42px;
    }
    a {
      color: $primary-color;
      text-decoration: none;
    }
  }
  li,
  ul {
    text-indent: unset;
  }

  p,
  ul {
    margin: 0 0 1.25em;
  }

  ul {
    b {
      font-weight: 600;
    }
    ul {
      margin: 0 0 0.75em;
    }
  }

  h2 {
    font-family: Anuphan, system-ui, -apple-system, sans-sreif !important;
    font-size: 20px;
    font-weight: 700;
    line-height: 24px;
    color: $primary-color;
    margin-bottom: 0.75em;
    @media screen and (max-width: 576px) {
      font-size: 22px;
    }
  }
}
</style>
